generator/content/blog/erlang/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-10 Fri 03:21 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org0deee12" class="outline-2">
<h2 id="org0deee12">Erlang</h2>
<div class="outline-text-2" id="text-org0deee12">
<p>
This is a collection of Erlang links I've come across over time. Expect heavy modifications as I make formatting
decisions and encounter ever more.
</p>
</div>

<div id="outline-container-org525949d" class="outline-3">
<h3 id="org525949d">Implementations and tools:</h3>
<div class="outline-text-3" id="text-org525949d">
<dl class="org-dl">
<dt><a href="https://www.erlang.org/">Erlang</a></dt><dd>The standard implementation</dd>
<dt><a href="https://github.com/atomvm/AtomVM">AtomVM</a></dt><dd>Minimal VM meant to run on ESP32 SoCs, STM32 MCUs, RPi Pico, Wasm etc.</dd>
<dt>(no term)</dt><dd>See also: <a href="https://www.erlang.org/faq/implementations">https://www.erlang.org/faq/implementations</a></dd>

<dt>(no term)</dt><dd><a href="https://hex.pm">Hex package manager</a></dd>
</dl>
</div>
</div>

<div id="outline-container-orgd005be3" class="outline-3">
<h3 id="orgd005be3">Documentation</h3>
<div class="outline-text-3" id="text-orgd005be3">
<dl class="org-dl">
<dt><a href="https://www.erlang.org/doc/">https://www.erlang.org/doc/</a></dt><dd>Online documentation for the latest version of the run-time system as well as all the libraries.</dd>
<dt><a href="https://www.erldocs.com/">erldocs</a></dt><dd>An alternative Erlang documentation</dd>
</dl>
</div>
</div>

<div id="outline-container-orgf34e351" class="outline-3">
<h3 id="orgf34e351">Books, documentation, tutorials and more:</h3>
<div class="outline-text-3" id="text-orgf34e351">
<dl class="org-dl">
<dt><a href="https://www.erlang.org/docs">https://www.erlang.org/docs</a></dt><dd>A collection of links to documentation, books and papers</dd>
<dt><a href="https://www.erlang.org/community">https://www.erlang.org/community</a></dt><dd>Includes learning matterial provided by the community</dd>
<dt><a href="http://www.erlang.se/doc/programming_rules.shtml">Programming Rules and Conventions</a></dt><dd>Guidelines for writing systems using Erlang. Mirrors: <a href="https://docs.jj1bdx.tokyo/Erlang_Programming_Rules.html">1</a>, <a href="https://web.archive.org/web/20211018191823/http://www.erlang.se/doc/programming_rules.shtml">2</a></dd>
<dt><a href="https://learnyousomeerlang.com/content">Learn You Some Erlang for Great Good!</a></dt><dd>A free online book for learning Erlang</dd>
<dt><a href="https://rosettacode.org/wiki/Category:Erlang">Rosetta Code on Erlang</a></dt><dd>A wiki presenting solutions to problems in many different languages</dd>
<dt><a href="https://github.com/joearms/crypto_tutorial/">Cryptography Tutorial</a></dt><dd>A cryptography book with Erlang examples by Joe Armstrong</dd>
<dt><a href="https://blog.stenmans.org/theBeamBook/">The Beam Book</a></dt><dd><b>An advanced book describing in detail the Erlang RunTime System (ERTS)</b></dd>
</dl>
</div>
</div>

<div id="outline-container-org5f28265" class="outline-3">
<h3 id="org5f28265">Tools</h3>
<div class="outline-text-3" id="text-org5f28265">
<dl class="org-dl">
<dt><a href="https://rebar3.org/">Rebar3</a></dt><dd>The official build tool for Erlang.</dd>
<dt>(no term)</dt><dd><a href="http://tryerl.seriyps.ru/">Online Erlang repl</a></dd>
<dt><a href="https://www.erldocs.com/function">erldocs function lookup</a></dt><dd>Find out which Erlang/OTP versions support a given function</dd>
</dl>
</div>
</div>

<div id="outline-container-org045f80c" class="outline-3">
<h3 id="org045f80c">Community</h3>
<div class="outline-text-3" id="text-org045f80c">
<dl class="org-dl">
<dt><a href="https://www.erlang.org/community">https://www.erlang.org/community</a></dt><dd>Includes links to the official community channels</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-05-10 Fri 03:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
